package com.e1i5.backend.domain.user.dto;

public class RandomNickname {
    public static final String[] ADJECTIVES = {
            "즐거운", "행복한", "신나는", "아름다운", "활기찬", "쾌활한", "싱그러운", "화려한", "따뜻한", "신선한",
            "기쁜", "자유로운", "밝은", "창의적인", "우아한", "자연스러운", "편안한", "건강한", "풍요로운", "흐린",
            "푸른", "달콤한", "맑은", "푸른", "깨끗한", "뛰어난", "다양한", "유쾌한", "고요한", "새로운",
            "안정된", "열정적인", "격렬한", "독특한", "신비로운", "예쁜", "독립적인", "매력적인", "목마른", "활발한",
            "뜨거운", "웅장한", "멋진", "정열적인", "강렬한", "장엄한", "명랑한", "특별한", "즉흥적인", "사랑스러운"
    };
    public static final String[] NOUNS = {
            "코더", "프로그래머", "개발자", "해커", "코딩닌자", "알고리즘마스터", "디버거", "코드마스터", "분석아재",
            "코드몽키", "코더홀릭", "구직고수", "면접괴물", "코딩대장",  "코딩히어로", "자율출근닌자", "코딩뽀롱뽀롱",
            "정규분포뽀로로", "산술연산쥐", "데이터은하수", "코딩곰", "알고리즘마법사",  "코딩곰토끼", "곰탱이", "굼뱅"
    };
//    public static final String[] WORDS = {
//            "치타치타", "코끼리뚝뚝", "판다판다", "하이에나하이에나", "펭귄뽀록뽀록", "사자왕자", "코알라", "앵무새", "강아지멍멍", "고양이냥냥",
//            "원숭이우끼끼", "호랑이어흥어흥", "기린길린", "오리꽥꽥", "캥거루뛰뛰", "악어짹짹", "하마둥실둥실", "돼지꿀꿀", "치킨곽곽", "오소리찍찍",
//            "다람쥐짹짹", "바다표범물물", "햄스터찍찍", "해마둥실둥실", "핑크펭귄뚝뚝", "안데스콘돌", "플라밍고핑크핑크", "푸들뿌잉뿌잉", "거북이뒹굴뒹굴", "라마깡충깡충",
//            "점박이개구리꽉꽉", "알파카깡충깡충", "파랑새찍찍", "거미쑥쑥", "도마뱀땅땅", "수달살랑살랑", "토끼꾸룩꾸룩", "코뿔소꽥꽥", "두더지깡충깡충", "백호어흥어흥"
//    };
}
